### START

### INTRODUCTION TO PANDAS PYTHON LIBRARY

1 pandas is the python library which represents the data in tabular form

2 pandas allows us to import the datasets from the csv or excel or SQL database data source

3 data cleaning involves the filling of missing values and replacing the invalid values 

4 missing value is null value and invalid value is when we get the incorrect data when we check the context

5 pandas have size mutability that means we can easily add or remove the columns and rows

6 we can reshape pivot manupulate extract our dataset as needed and also perform the statistic  analysis

### IMPORTING PANDAS LIBRARY

In [38]:
import pandas as pd

### DATA STRUCTURES IN PANDAS 
data structure is the collection of datatypes that provides the best way to organise the items or values interms of memory usage conbination to There are two types of data struture in pandas and they are series and data frame. 

The series is the one dimensional data struture and data frma eis two dimensional data struture 

The series represent only one column of the dataset and data frame represents entire dataset

SERIES DATASTRUTURE IN PANDAS

1 series represents the one dimensionaal data struture which can only hold one column from the dataset 

2 series will be the values of a particular column infront of which the index of the value is given. index always starts with 0

3 series contains only one column and yoiu can extend the rows as many as you want 

4 series is a homogeneous data struture that means it can only hold one kind of datatype and if we add another data type previous values of the series will be converted to current datatype 

5 datatype of the integer value is integer and object is the data type of string and only these two data types can be there in the series 

6 series is size immutable that means you cannot delete the row in series and if you remove the values then it will create new series with those values and will not change the original series

DATA FRAMES DATA STRUTURE IN PANDAS

1 data frame is two dimensional data struture which contains the rows and columns in it 

2 in data frame you can increase the number of rows and columns as well 

3 it is size mutable which means you can delete update or append the coulmns and rows 

4 its a heterogenous data struture which means you can have multiple data types in single column as well

### CREATING SERIES IN PANDAS
when we create the series using pandas we get the index values and data type of the series as output and we use series function of pandas to create the series data struture

creating array using the list

In [39]:
s1=pd.Series([10,20,30,40,50])
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

### PROPERTIES OF THE SERIES 
There are several properties of the series which can be checked such as data type values name and index of the series as given below 

initially the name of series is none and we can assign the desired name to series and when we access the series after that it will be denoted by that name

In [40]:
print(s1.dtype)
print(s1.values)
print(s1.index)
print(s1.name)
s1.name="calaries"
print(s1.name)
print(s1)

int64
[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)
None
calaries
0    10
1    20
2    30
3    40
4    50
Name: calaries, dtype: int64

### INDEXING IN SERIES DATA STRUTURE IN PANDAS

indexing in series is same like the python lists or numpy arrays. In series you can see the values at certain index based on range you give the start index and end index where end index is not including

In [41]:
s2=pd.Series([1,2,3,4,5])
print(s2[0])
print(s2[0:3])
print(s2[1:3])

1
0    1
1    2
2    3
dtype: int64
1    2
2    3
dtype: int64

indexing using the iloc function which does indexing based on location of the value so iloc function does the location based indexing which means it will use indexes 0,1,2,3,4 etc

In [42]:
print(s1.iloc[2])
print(s2.iloc[2])

30
3

iloc function is used when you want multiple values which are on different numerical indexes as given below

In [43]:
print(s2.iloc[[2,3]])

2    3
3    4
dtype: int64

### CUSTOM INDEXING IN SERIES

custom indexing is done in series when you dont want palin number as indext of the values and want to put some other data as index so that the series makes more sense.

we create the list and assign the list to series index to perform the custom indexing

custom indexing is done to represent the c=indexes in the more meaningful way so that the coulmn gives important info

In [44]:
print(s1)
idx=['apple','mango','banana','orange','pineapple']
s1.index=idx
print(s1)

0    10
1    20
2    30
3    40
4    50
Name: calaries, dtype: int64
apple        10
mango        20
banana       30
orange       40
pineapple    50
Name: calaries, dtype: int64

finding values of the series using custom indexes

In [45]:
print(s1['apple'])

10

iloc function is used to get the values at the numerical indexes but not for string indexes. For string indexing or custom indexing which is not number you can using loc function as given below 

remember that in label based indexing both start and end index is inclued where as in location based indexing end value is not incliuded

In [46]:
print(s1.loc[['apple','mango']])
print(s1.loc[['apple','mango','pineapple']])

apple    10
mango    20
Name: calaries, dtype: int64
apple        10
mango        20
pineapple    50
Name: calaries, dtype: int64

### CREATING SERIES USING PYTHON DICTIONARY

In [47]:
fruit_protein={
    'apple':0.5,
    'mango':1,
    'banana':1.5,
    'orange':2,
    'seetafal':2.5}
s3=pd.Series(fruit_protein)
s3.name='protein'
print(s3)

apple       0.5
mango       1.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

In [48]:
print(s3.index)
print(s3.dtype)
print(s3.values)
print(s3['seetafal'])
print(s3[['mango','banana','orange']])

Index(['apple', 'mango', 'banana', 'orange', 'seetafal'], dtype='object')
float64
[0.5 1.  1.5 2.  2.5]
2.5
mango     1.0
banana    1.5
orange    2.0
Name: protein, dtype: float64

### CONDTIONAL SELECTION IN SERIES

conditional selection is when you want to find out the data which is satisfying a particular condition you can directly use the condition on the entire series 

when we put a conition on series it returns mask series which can be then used inside the series to get the values

In [49]:
m=s3>1
s3[m]

banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### LOGICAL OPERATORS FOR PANDAS SERIES
logical operators are logical and logical or and logical not which can be used on series as well. We use & for and operator and | for or perator

for logical and we must have both condition true to get true result where as for or operator we need any one condition to be true to the output based on that true condition

In [50]:
mask=s3[(s3>0.5)&(s3<2)]
print(mask)

mango     1.0
banana    1.5
Name: protein, dtype: float64

In [51]:
mask=s3[(s3>0.5) | (s3<2)]
print(mask)

apple       0.5
mango       1.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

In [52]:
print(s3[s3!=1])

apple       0.5
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### MODIFYING THE DATA IN PANDAS SERIES 
The data in the series can also be modified as we do normally for list or numpy arrays using the location or lebel index

In [53]:
s3["mango"]=4
print(s3)

apple       0.5
mango       4.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### DATAFRAME DATA STRUCTURE IN PANDAS

we can convert the dictionary into data frames so that they can be easily be represented properly in the form of table. A dataframe is a two dimensional data struture in pandas where rows and columns both are accepted

In [54]:
data={
    'names':['sagar','rahul','akshay','reshma','divya','ramesh','suresh'],
    'Age':[34,31,33,28,25,54,45],
    'department':['IT','HR','Finance','Admin','marketing','sales','managemnt']
}
empdata=pd.DataFrame(data)
print(empdata)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### ACCESSING TOP AND BOTTOM ITESM OF DATAFRAME
Head and tail functions are used to get the top or bottom values from the data frame

In [55]:
empdata.head(3)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance

In [56]:
empdata.tail(3)

    names  Age department
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### INDEXING IN DATA FRAME 
The iloc and loc functions can be used for indexing in data frame for accessing the different values based on index iloc is used to get values at index and loc is used to fetch the selected coulmns from the entire dataframe 

iloc: gives all the columns of the data frame for specified indexes 

loc: gives the only selected columns within specified range of index

In [57]:
empdata.iloc[0:3]

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance

In [58]:
empdata.loc[0:2,['Age','department']]

   Age department
0   34         IT
1   31         HR
2   33    Finance

### NOTE: 
Always make sure to use the column names as defined in dataframe including the casing whem ujsing iloc function we must pass rows, columns inside it for getting the desired result

also make sure thst your data frame exists so that these operations can be performed without errors

accessing individualcolumns of the data frame 
To access the particular column in the dataframe yoo can use dataframe['column'] and that particular coulmn will show all the rows of the dataframe

In [59]:
empdata['Age']
empdata[['Age','department']]

   Age department
0   34         IT
1   31         HR
2   33    Finance
3   28      Admin
4   25  marketing
5   54      sales
6   45  managemnt

### DROPPING ROWS AND COULMNS IN DATA FRAMES 
To drop the rows and columns of the data frame you can use the drop function with your dataframe name as given below 

axis 0 is used for rows and axis 1 is columns

In [60]:
empdata.drop('Age',axis=1)
print(empdata)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

NOTE : you observe that even after dropping age column it shows up because the inplace parameter is false by default so it does not make changes to dataframe so if you want to drop the column from data frame you must assigne true to inplace parameter as given below

In [61]:
empdata.drop('Age',axis=1,inplace=True)
print(empdata)

    names department
0   sagar         IT
1   rahul         HR
2  akshay    Finance
3  reshma      Admin
4   divya  marketing
5  ramesh      sales
6  suresh  managemnt

DROPPING ROWS OR SAMPLES FROM THE DATA FRAME

In [62]:
empdata
empdata.drop(1,axis=0,inplace=True)
empdata

    names department
0   sagar         IT
2  akshay    Finance
3  reshma      Admin
4   divya  marketing
5  ramesh      sales
6  suresh  managemnt

### ADDING ROWS AND COLUMNS TO DATAFRAME

Adding columns to the existing data frame

In [69]:
empdata
empdata['Salary']=[10000,20000,30000,40000,50000,60000]
empdata
empdata.reset_index(drop=True,inplace=True)
empdata

    names department  Salary
0   sagar         IT   10000
1  akshay    Finance   20000
2  reshma      Admin   30000
3   divya  marketing   40000
4  ramesh      sales   50000
5  suresh  managemnt   60000

Adding rows to exiting dataframe you can add it at the end of the data frame using loc function and you can add at top using another dataframe and concat function

adding rows at end of the dataframe using dictionary and loc function as given below

In [70]:
nr={
    "names":"sagar",
    "department":"IT",
    "salary":90000
}
empdata.loc[len(empdata)]=nr
print(empdata)

    names department   Salary
0   sagar         IT  10000.0
1  akshay    Finance  20000.0
2  reshma      Admin  30000.0
3   divya  marketing  40000.0
4  ramesh      sales  50000.0
5  suresh  managemnt  60000.0
6   sagar         IT      NaN

adding rows at the begining 

when you are adding rows at the begining you can create one dataframe with all new samples and than ypu can contact it with exisitng dataframe to get the result

In [71]:
nr=pd.DataFrame({
    "names":["sagar",'arjun'],
    "department":["IT",'marketing'],
    "salary":[90000,200000]
})
empdata=pd.concat([nr,empdata],ignore_index=True)
print(empdata)

    names department    salary   Salary
0   sagar         IT   90000.0      NaN
1   arjun  marketing  200000.0      NaN
2   sagar         IT       NaN  10000.0
3  akshay    Finance       NaN  20000.0
4  reshma      Admin       NaN  30000.0
5   divya  marketing       NaN  40000.0
6  ramesh      sales       NaN  50000.0
7  suresh  managemnt       NaN  60000.0
8   sagar         IT       NaN      NaN

In [95]:
data={
    'names':['sagar','rahul','akshay','reshma','divya','ramesh','suresh'],
    'Age':[34,31,33,28,25,54,45],
    'department':['IT','HR','Finance','Admin','marketing','sales','managemnt']
}
empdata2=pd.DataFrame(data)
print(empdata2)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### FUNCTIONS USED ON DATAFRMAE 
there are many functions which can be used on the data frame for getting information and structure of data frame as given below

shape function gives the number of rows and coulmns in dataframe

In [97]:

print(empdata.shape)
print(empdata2.shape)

(7, 3)
(7, 3)

NOTE : indexes are not included as the columns they are there by default and each row is called as sample when we atre dealing with dataframe and each column is called as feature in data frame

dataype function : we can use the dtype function in data frame to get the data types of the data frame

In [98]:
print(empdata.dtypes)
print(empdata2.dtypes)

names          object
department     object
Salary        float64
dtype: object
names         object
Age            int64
department    object
dtype: object

Info function : this is used to get other information about our data frame such as its class total samples and features their data types and non null values and null values

In [99]:
empdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 1 to 7
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       7 non-null      object
 1   department  7 non-null      object
 2   Salary      6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [100]:
empdata2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       7 non-null      object
 1   Age         7 non-null      int64
 2   department  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

describe function: describe function is used on the data frame to get the statistical information related to that data frame as given below

In [101]:
empdata2.describe()

             Age
count   7.000000
mean   35.714286
std    10.226017
min    25.000000
25%    29.500000
50%    33.000000
75%    39.500000
max    54.000000

In [102]:
empdata.describe()

             Salary
count      6.000000
mean   30000.000000
std    20976.176963
min    10000.000000
25%    12500.000000
50%    25000.000000
75%    45000.000000
max    60000.000000

### RESETTING INDEX OF DATAFRAME 

when index is messed up for your data frame after you add or drop the columns or rows you can reset it using reset_index function put drop to true

In [ ]:

empdata['Age']=[36,34,45,54,65,23,29]
empdata

      names  department   Salary  Age
1  shraddha       admin  10000.0   36
2     sagar          IT  10000.0   34
3    akshay     Finance  20000.0   45
4    reshma       Admin  30000.0   54
5       ram  automation      NaN   65
6    ramesh       sales  50000.0   23
7    suresh   managemnt  60000.0   29

In [106]:
empdata.reset_index(drop=True,inplace=True)
empdata

      names  department   Salary  Age
0  shraddha       admin  10000.0   36
1     sagar          IT  10000.0   34
2    akshay     Finance  20000.0   45
3    reshma       Admin  30000.0   54
4       ram  automation      NaN   65
5    ramesh       sales  50000.0   23
6    suresh   managemnt  60000.0   29

### BROADCASTING IN DATA FRAMES
When the scaler value is stretched to match the shape of the column array then its called as broadcasting

In [108]:
empdata['Salary']
empdata['Salary']+=5000
print(empdata)

      names  department   Salary  Age
0  shraddha       admin  15000.0   36
1     sagar          IT  15000.0   34
2    akshay     Finance  25000.0   45
3    reshma       Admin  35000.0   54
4       ram  automation      NaN   65
5    ramesh       sales  55000.0   23
6    suresh   managemnt  65000.0   29

### ADDING ROWS AT ANY POSITION USING LOC FUNCTION

In [ ]:
empdata.loc[2.5]=['sunder','management',35000,24]
empdata

        names  department   Salary  Age
0.0  shraddha       admin  15000.0   36
1.0     sagar          IT  15000.0   34
2.0    shweta  management  35000.0   24
3.0    reshma       Admin  35000.0   54
4.0       ram  automation      NaN   65
5.0    ramesh       sales  55000.0   23
6.0    suresh   managemnt  65000.0   29
2.5    sunder  management  35000.0   24

In [114]:
empdata.reset_index(drop=True,inplace=True)
empdata

      names  department   Salary  Age
0  shraddha       admin  15000.0   36
1     sagar          IT  15000.0   34
2    shweta  management  35000.0   24
3    reshma       Admin  35000.0   54
4       ram  automation      NaN   65
5    ramesh       sales  55000.0   23
6    suresh   managemnt  65000.0   29
7    sunder  management  35000.0   24

### RENAMING THE COLUMNS IN DATAFRAME 
The columns of the data frame can be renamed using the renmae function as given below:

In [115]:
empdata.rename(columns={'names':'Name'},inplace=True)
empdata.rename(columns={'department':'Department'},inplace=True)
empdata

       Name  Department   Salary  Age
0  shraddha       admin  15000.0   36
1     sagar          IT  15000.0   34
2    shweta  management  35000.0   24
3    reshma       Admin  35000.0   54
4       ram  automation      NaN   65
5    ramesh       sales  55000.0   23
6    suresh   managemnt  65000.0   29
7    sunder  management  35000.0   24

### SOME IMPORTANT COLUMN FUNCTIONS

UNIQUE FUNCTION: 

finding the unique values in column of dataframe using unique() function always remember that the names of columns and data is case sensitive

In [116]:
empdata['Name'].unique()

array(['shraddha', 'sagar', 'shweta', 'reshma', 'ram', 'ramesh', 'suresh',
       'sunder'], dtype=object)

COUNT AND VALUE_COUNT FUNCTION:

you can also count of total number of the values of the column and value count gives the count of repeating values within that column as well as given below

In [118]:
empdata['Name'].count()

np.int64(8)

In [119]:
empdata['Department'].value_counts()

Department
management    2
admin         1
IT            1
Admin         1
automation    1
sales         1
managemnt     1
Name: count, dtype: int64

ADDING COLUMNS TO DATA FRAME

In [120]:
empdata['Promoted_Salary']=empdata['Salary']*10
print(empdata)

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation      NaN   65              NaN
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0

ADDING ROWS TO DATA FRAME 
rows can be added to data frame using the concat method make sure that the datafrmae which you create must have list as values not the single or scaler value

In [128]:
import numpy as np
nr=pd.DataFrame(
    {
        "Name":['alok'],
        'Department':['admin'],
        'Salary':[np.nan],
        'Age':[65],
        'Promoted_Salary':[np.nan]
    }
)
empdata=pd.concat([empdata,nr],ignore_index=True)
print(empdata)

       Name  Department   Salary  Age  Promoted_Salary  Promoted Salary
0  shraddha       admin  15000.0   36         150000.0              NaN
1     sagar          IT  15000.0   34         150000.0              NaN
2    shweta  management  35000.0   24         350000.0              NaN
3    reshma       Admin  35000.0   54         350000.0              NaN
4       ram  automation      NaN   65              NaN              NaN
5    ramesh       sales  55000.0   23         550000.0              NaN
6    suresh   managemnt  65000.0   29         650000.0              NaN
7    sunder  management  35000.0   24         350000.0              NaN
8      alok       admin      NaN   65              NaN              NaN
9      alok       admin      NaN   65              NaN              NaN

### CHECKING AND DEALING WITH NULL VALUES IN DATAFRAMES:

you can check where the null values are present in your dataframe as given below where we check null values and sum them as per column

In [135]:
empdata.isnull().sum()

Name               0
Department         0
Salary             3
Age                0
Promoted_Salary    3
dtype: int64

DROPNA function : na stands for null values

dropna function is used when you want to get rid of the samples which contains the null values and it will reflect it in dataframe if you give inpalce=true while calling dropna() as given below

there is how parameter of the dropna function which can take any or all as arguments 

all--- removes the sample only if all values are null 
any--- if any column of the sample is null it will remove the sample

In [141]:
empdata.dropna()

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0

In [142]:
empdata.dropna(axis=0,how='any')

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0

In [143]:
empdata.dropna(axis=0,how='all')

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation      NaN   65              NaN
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0
8      alok       admin      NaN   65              NaN
9      alok       admin      NaN   65              NaN

FILLING THE NULL VALUES

The missing values or the null values can be delt in two ways either we can drop them using dropna function or we can fill them using fillna function

In [144]:
empdata.fillna(0)

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation      0.0   65              0.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0
8      alok       admin      0.0   65              0.0
9      alok       admin      0.0   65              0.0

NOTE: you can replace the null values with 0 but thats not hwo we deal with missing data and we msut fill it with more meaningful data

In [146]:
empdata.fillna(empdata['Salary'].median(),inplace=True)
empdata

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation  35000.0   65          35000.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0
8      alok       admin  35000.0   65          35000.0
9      alok       admin  35000.0   65          35000.0

In [148]:
empdata.fillna(empdata['Promoted_Salary'].median(),inplace=True)
empdata

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1     sagar          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation  35000.0   65          35000.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0
8      alok       admin  35000.0   65          35000.0
9      alok       admin  35000.0   65          35000.0

FORWARD AND BACKWORD FILLS FOR MISSING VALUES

if we move from top to bottom in the column of the dataframe and there is missing value if we do forward fill the missing value is replaced by the value above it 

if we use backward ifll the value after the missing value is filled in the missing value

FORWARD FILL:

In [151]:
empdata['Salary'].fillna(method='ffill')
empdata['Salary'].fillna(method='bfill')

C:\Users\3525\AppData\Local\Temp\ipykernel_19092\2868929437.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  empdata['Salary'].fillna(method='ffill')
C:\Users\3525\AppData\Local\Temp\ipykernel_19092\2868929437.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  empdata['Salary'].fillna(method='bfill')

0    15000.0
1    15000.0
2    35000.0
3    35000.0
4    35000.0
5    55000.0
6    65000.0
7    35000.0
8    35000.0
9    35000.0
Name: Salary, dtype: float64

### REPLACING THE EXISTING VALUE WITH NEW ONE IN DATAFRAME

for replacing any values in the column you cqan use the replace method for dataframe as given below a

In [152]:

empdata['Name'].replace('sagar','abhishek',inplace=True)
empdata

C:\Users\3525\AppData\Local\Temp\ipykernel_19092\992779206.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  empdata['Name'].replace('sagar','abhishek',inplace=True)

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1  abhishek          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation  35000.0   65          35000.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0
8      alok       admin  35000.0   65          35000.0
9      alok       admin  35000.0   65          35000.0

### DEALING WITH DUPLICATE DATA IN DATAFRAME

CHECKING FOR DUPLICATE VALUES:

The sample is only categorized as duplicate if and only if all the features of that sample are same with another sample 

There is a keep parameter for duplicated function which can take first and last as argument which means it will not mark first element as duplicate and when we give last it will not mark last element as duplicate

In [155]:
dup=empdata[empdata.duplicated()]
dup

   Name Department   Salary  Age  Promoted_Salary
9  alok      admin  35000.0   65          35000.0

Dropping duplicate samples

In [156]:
empdata.drop_duplicates()

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36         150000.0
1  abhishek          IT  15000.0   34         150000.0
2    shweta  management  35000.0   24         350000.0
3    reshma       Admin  35000.0   54         350000.0
4       ram  automation  35000.0   65          35000.0
5    ramesh       sales  55000.0   23         550000.0
6    suresh   managemnt  65000.0   29         650000.0
7    sunder  management  35000.0   24         350000.0
8      alok       admin  35000.0   65          35000.0

### DEALING WITH INVALID VALUES IN DATAFRAME

we can deal with the invalid values which are the values not possible for that column data representation using the lamda fucntion and apply function

In [158]:
empdata['Promoted_Salary']=empdata['Promoted_Salary'].apply(lambda x :x/10 if x>100000 else x)
empdata

       Name  Department   Salary  Age  Promoted_Salary
0  shraddha       admin  15000.0   36          15000.0
1  abhishek          IT  15000.0   34          15000.0
2    shweta  management  35000.0   24          35000.0
3    reshma       Admin  35000.0   54          35000.0
4       ram  automation  35000.0   65          35000.0
5    ramesh       sales  55000.0   23          55000.0
6    suresh   managemnt  65000.0   29          65000.0
7    sunder  management  35000.0   24          35000.0
8      alok       admin  35000.0   65          35000.0
9      alok       admin  35000.0   65          35000.0

In [159]:
empdata['Age']=empdata['Age'].apply(lambda X: X/2)
empdata

       Name  Department   Salary   Age  Promoted_Salary
0  shraddha       admin  15000.0  18.0          15000.0
1  abhishek          IT  15000.0  17.0          15000.0
2    shweta  management  35000.0  12.0          35000.0
3    reshma       Admin  35000.0  27.0          35000.0
4       ram  automation  35000.0  32.5          35000.0
5    ramesh       sales  55000.0  11.5          55000.0
6    suresh   managemnt  65000.0  14.5          65000.0
7    sunder  management  35000.0  12.0          35000.0
8      alok       admin  35000.0  32.5          35000.0
9      alok       admin  35000.0  32.5          35000.0

### JOINS AND MERGES IN DATAFRAME
Joins can be inner and outer join and outer joins can be left outer joins or right outer join

merge : when we merge the two datsets all things which are available in dataset a and dataset b will be combined

In [12]:
dept_info={
    'Department':['HR','IT','Finance'],
    'location':['delhi','mumbai','bangalore'],
    'manager':['himesh','mukesh','hari']
}
dinfo=pd.DataFrame(dept_info)
dinfo

  Department   location manager
0         HR      delhi  himesh
1         IT     mumbai  mukesh
2    Finance  bangalore    hari

In [13]:
import pandas as pd
emp=pd.DataFrame(
    {
        'Name':['sagar','rahul','akshay','praveen','arther'],
        'Age':[24,26,28,31,35],
        'Dept':['IT','HR','admin','marketing','sales'],
        'salary':[10000,20000,30000,40000,50000]
    }
)
emp

      Name  Age       Dept  salary
0    sagar   24         IT   10000
1    rahul   26         HR   20000
2   akshay   28      admin   30000
3  praveen   31  marketing   40000
4   arther   35      sales   50000

The concat function is used to combine the dataframes which is called as joining as given below 

when you concat without specifying the azis the twwo tables are put one below other that means they are stacked rows wise horizontaly

In [5]:
pd.concat([emp,dinfo])

      Name   Age       Dept   salary Department   location manager
0    sagar  24.0         IT  10000.0        NaN        NaN     NaN
1    rahul  26.0         HR  20000.0        NaN        NaN     NaN
2   akshay  28.0      admin  30000.0        NaN        NaN     NaN
3  praveen  31.0  marketing  40000.0        NaN        NaN     NaN
4   arther  35.0      sales  50000.0        NaN        NaN     NaN
0      NaN   NaN        NaN      NaN         HR      delhi  himesh
1      NaN   NaN        NaN      NaN         IT     mumbai  mukesh
2      NaN   NaN        NaN      NaN    Finance  bangalore    hari

In [6]:
pd.concat([dinfo,emp])

  Department   location manager     Name   Age       Dept   salary
0         HR      delhi  himesh      NaN   NaN        NaN      NaN
1         IT     mumbai  mukesh      NaN   NaN        NaN      NaN
2    Finance  bangalore    hari      NaN   NaN        NaN      NaN
0        NaN        NaN     NaN    sagar  24.0         IT  10000.0
1        NaN        NaN     NaN    rahul  26.0         HR  20000.0
2        NaN        NaN     NaN   akshay  28.0      admin  30000.0
3        NaN        NaN     NaN  praveen  31.0  marketing  40000.0
4        NaN        NaN     NaN   arther  35.0      sales  50000.0

when you mention the axis as 1 than two tables are put side by side and they are joined column as vertically

In [7]:
pd.concat([emp,dinfo],axis=1)

      Name  Age       Dept  salary Department   location manager
0    sagar   24         IT   10000         HR      delhi  himesh
1    rahul   26         HR   20000         IT     mumbai  mukesh
2   akshay   28      admin   30000    Finance  bangalore    hari
3  praveen   31  marketing   40000        NaN        NaN     NaN
4   arther   35      sales   50000        NaN        NaN     NaN

when you dont want your common columns not to show up multiple times you can use the merge function this will give all records which have matching values in both table

In [ ]:
emp.rename(columns={'Dept':'Department'},inplace=True)

  Department   location manager
0         HR      delhi  himesh
1         IT     mumbai  mukesh
2    Finance  bangalore    hari

In [28]:
pd.merge(emp,dinfo,on='Department')

    Name  Age Department  salary location manager
0  sagar   24         IT   10000   mumbai  mukesh
1  rahul   26         HR   20000    delhi  himesh

### IMPORTING DDIFFERENT FORMAT OF DATA FOR ANALYSIS 

You can also import the csv or excel or sql database as well and than you cqan go ahead with data analysis 

if you want to import the csv file you can use read_csv and if you want to import the wexcel file you can use read_excel function 

always use the r string which is raw strings for paths of thr files

IMPORTING THE CSV FILES

In [ ]:
data=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\bikestore_dataset\products.csv")

,product_id,product_name,brand_id,category_id,model_year,list_price
0,1,Trek 820 - 2016,9,6,2016,379.99
1,2,Ritchey Timberwolf Frameset - 2016,5,6,2016,749.99
2,3,Surly Wednesday Frameset - 2016,8,6,2016,999.99
3,4,Trek Fuel EX 8 29 - 2016,9,6,2016,2899.99
4,5,Heller Shagamaw Frame - 2016,3,6,2016,1320.99
...,...,...,...,...,...,...
316,317,Trek Checkpoint ALR 5 - 2019,9,7,2019,1999.99
317,318,Trek Checkpoint ALR 5 Women's - 2019,9,7,2019,1999.99
318,319,Trek Checkpoint SL 5 Women's - 2019,9,7,2019,2799.99
319,320,Trek Checkpoint SL 6 - 2019,9,7,2019,3799.99
320,321,Trek Checkpoint ALR Frameset - 2019,9,7,2019,3199.99

IMPORTING EXCEL FILES

In [37]:
d=pd.read_excel(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\superstore_dataset\Orders.xlsx")
d

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,7981,CA-2014-103800,2014-01-03,2014-01-07,Standard Class,DP-13000,Darren Powers,Consumer,United States,Houston,...,77095,Central,OFF-PA-10000174,Office Supplies,Paper,"Message Book, Wirebound, Four 5 1/2"" X 4"" Form...",16.448,2,0.2,5.5512
1,740,CA-2014-112326,2014-01-04,2014-01-08,Standard Class,PO-19195,Phillina Ober,Home Office,United States,Naperville,...,60540,Central,OFF-LA-10003223,Office Supplies,Labels,Avery 508,11.784,3,0.2,4.2717
2,741,CA-2014-112326,2014-01-04,2014-01-08,Standard Class,PO-19195,Phillina Ober,Home Office,United States,Naperville,...,60540,Central,OFF-ST-10002743,Office Supplies,Storage,SAFCO Boltless Steel Shelving,272.736,3,0.2,-64.7748
3,742,CA-2014-112326,2014-01-04,2014-01-08,Standard Class,PO-19195,Phillina Ober,Home Office,United States,Naperville,...,60540,Central,OFF-BI-10004094,Office Supplies,Binders,GBC Standard Plastic Binding Systems Combs,3.540,2,0.8,-5.4870
4,1760,CA-2014-141817,2014-01-05,2014-01-12,Standard Class,MB-18085,Mick Brown,Consumer,United States,Philadelphia,...,19143,East,OFF-AR-10003478,Office Supplies,Art,Avery Hi-Liter EverBold Pen Style Fluorescent ...,19.536,3,0.2,4.8840
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1988,7681,CA-2014-133592,2014-12-31,2015-01-07,Standard Class,KM-16375,Katherine Murray,Home Office,United States,Providence,...,2908,East,FUR-BO-10000362,Furniture,Bookcases,Sauder Inglewood Library Bookcases,341.960,2,0.0,78.6508
1989,7682,CA-2014-133592,2014-12-31,2015-01-07,Standard Class,KM-16375,Katherine Murray,Home Office,United States,Providence,...,2908,East,FUR-CH-10004218,Furniture,Chairs,"Global Fabric Manager's Chair, Dark Gray",605.880,6,0.0,151.4700
1990,8603,US-2014-133949,2014-12-31,2014-12-31,Same Day,JL-15175,James Lanier,Home Office,United States,Reno,...,89502,West,TEC-PH-10004908,Technology,Phones,Panasonic KX TS3282W Corded phone,475.944,7,0.2,59.4930
1991,8804,CA-2014-157644,2014-12-31,2015-01-01,First Class,AH-10030,Aaron Hawkins,Corporate,United States,New York City,...,10035,East,TEC-AC-10003614,Technology,Accessories,Verbatim 25 GB 6x Blu-ray Single Layer Recorda...,34.770,3,0.0,11.4741
1992,8805,CA-2014-157644,2014-12-31,2015-01-01,First Class,AH-10030,Aaron Hawkins,Corporate,United States,New York City,...,10035,East,OFF-LA-10003148,Office Supplies,Labels,Avery 51,18.900,3,0.0,8.6940

### END